app/views/microposts/_micropost.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`micropost_id` = 15
---
    <div>
      <% micropost.comments.each do |comment| %>