app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `micropost_id`, `content`, `created_at`, `updated_at`) VALUES (1, 15, '。。。', '2015-07-27 09:40:31', '2015-07-27 09:40:31')
---
  def create
    @comment = Comment.new(comment_params)
    @comment.save