app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('abbbbbbbbbbbbbbb', 1, '2015-07-27 08:13:44', '2015-07-27 08:13:44')
---
  def create
    @comment= Comment.new
    @micropost = current_user.microposts.build(micropost_params)
    @microposts= Micropost.where(["user_id=?",current_user.id])
     if @micropost.save

DELETE FROM `microposts` WHERE `microposts`.`id` = 23
---
  def destroy
    @micropost.destroy

SELECT  `goods`.* FROM `goods` WHERE `goods`.`user_id` IS NULL AND `goods`.`micropost_id` IS NULL LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` IS NULL LIMIT 1
DELETE FROM `goods` WHERE `goods`.`id` = 8
INSERT INTO `goods` (`user_id`, `micropost_id`, `created_at`, `updated_at`) VALUES (1, 16, '2015-07-28 03:27:41', '2015-07-28 03:27:41')
UPDATE `microposts` SET `is_good` = 1, `updated_at` = '2015-07-28 03:30:05' WHERE `microposts`.`id` = 16
---
  def is_goods
    good = Good.find_by_user_id_and_micropost_id(params[:user_id],params[:micropost_id])
    micropost = Micropost.find_by_id(params[:micropost_id])
    p good ,params[:type]
    if params[:type]==0 or good
      good.destroy
      micropost.is_good= micropost.is_good-1 if micropost and micropost.is_good.to_i>0
    else
      Good.transaction do
        Good.create(:user_id=>params[:user_id],:micropost_id=>params[:micropost_id])
        micropost.is_good= micropost.is_good.to_i+1
      end
    end
      micropost.save