app/controllers/static_pages_controller.rb

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = NULL LIMIT 1
---
  def home
    @micropost = Micropost.new()
    if current_user
      @microposts= Micropost.where(["user_id=?",current_user.id])