app/controllers/users_controller.rb

  def create
    @user= User.new(user_params)
    @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('huanghua00', 'huanghua00@qq.com', '$2a$10$qKQjbKMWXYzZO5TgqWpQyePlt6wQBSz3ssIw950z/ZkXI0FKOcMPq', '2015-07-24 10:06:13', '2015-07-24 10:06:13')

  def create_login_session
    # p params[:session][:email],params[:session][:password]
    user = User.find_by_email(params[:session][:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'huanghua00@qq.com' LIMIT 1